---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbol
source: html/af0bf909-a1ac-d826-8c99-a6967adcf30e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSymbol Property

While making curved beam type "[Type Name]" Symbol elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentSymbol { get; }
```